[
	[
	{
		"title": "tray_rust",
		"image": "http://i.imgur.com/9QU6fOU.png",
		"gh_user": "Twinklebear",
		"gh_repo": "tray_rust",
		"description": "tray_rust is a toy physically based ray tracer built off of the techniques
			discussed in [Physically Based Rendering](http://pbrt.org/). It began life as a port of
			[tray](https://github.com/Twinklebear/tray) to [Rust](http://www.rust-lang.org) to check out the language.
			The renderer is currently capable of path tracing, supports triangle meshes (MTL support coming soon),
			and various physically based material models (including measured data from the
			[MERL BRDF Database](http://www.merl.com/brdf/)). Rendering performance is also pretty decent, some
			more details on timings and hardware used can be found in the
			[README](https://github.com/Twinklebear/tray_rust/blob/master/README.md)\n\n
			In the image above the Rust logo model was made by
			[Nylithius on BlenderArtists](http://blenderartists.org/forum/showthread.php?362836-Rust-language-3D-logo) and
			the Buddha and Dragon are from the [Stanford 3D Scanning Repository](http://graphics.stanford.edu/data/3Dscanrep/)
			The materials on the Rust logo, Buddha and Dragon are from the [MERL BRDF Database](http://www.merl.com/brdf/).\n\n
			In the future I plan to add support for area lights, more complex materials (eg. subsurface scattering)
			and more advanced integration methods (eg. vertex connection and merging)."
	},
	{
		"title": "tobj",
		"image": "http://i.imgur.com/wImyNG4.png",
		"gh_user": "Twinklebear",
		"gh_repo": "tobj",
		"description": "tobj is a tiny OBJ loader in Rust that draws inspiration for its API and design from
			Syoyo's excellent library, [tinyobjloader](https://github.com/syoyo/tinyobjloader).
			The crate aims to be a simple, fast and
			lightweight option for loading OBJ and MTL files for easy integration with realtime and offline
			renderers, or really any other project where you need to load OBJ files!\n\n
			The image shown is from a demo viewer written to test tobj named
			[tobj_viewer](https://github.com/Twinklebear/tobj_viewer) displaying the
			[Rungholt](http://graphics.cs.williams.edu/data/meshes.xml) model. The model can be found on
			Morgan McGuire's meshes page and was originally built by kescha."
	},
	{
		"title": "ssao",
		"image": "http://i.imgur.com/byM8iNh.png",
		"gh_user": "Twinklebear",
		"gh_repo": "ssao",
		"description": "This is sort of an implementation of
			[Scalable Ambient Obscurance by McGuire et al.](http://graphics.cs.williams.edu/papers/SAOHPG12/)
			however I make a few simplifying shortcuts in my implementation and don't achieve as good performance
			or quality. I was also unable to get their new recommended estimator to behave so this implementation
			still uses the Alchemy AO estimator initially recommended in the paper. There's a somewhat longer write
			up available on [my classpage](http://www.willusher.io/courses/cs6610/) since this was initially
			implemented as a class project.\n\n
			The image shows just the ambient occlusion value for a view of the Crytek Sponza scene."
	}
	],

	[
	{
		"title": "μPacket",
		"image": "http://i.imgur.com/WcM6Rcl.png",
		"gh_user": "Twinklbear",
		"gh_repo": "micro-packet",
		"description": "μPacket is an extremely simple packet based ray tracer that uses the AVX/AVX2 instruction
			set to trace eight rays at once through the scene. Currently it only supports spheres and planes
			with Lambertian BRDFs illuminated by a single point light. Illumination is computed with Whitted ray
			tracing, although recursion only goes as far as computing shadows since there are no reflective
			or transmissive materials at the moment.\n\n
			Ray packets were first introduced by [Wald et al., 2001](http://www.sci.utah.edu/~wald/Publications/2001/CRT/CRT.pdf)
			and are now widely used in high performance ray tracers like [Embree](http://embree.github.io/) due to
			the performance gain achieved with good packet (and now stream) tracing techniques.\n\n
			Current plans for this project are to switch to trace ray streams and add support for a path tracing
			integrator for higher quality images."
	},
	{
		"title": "tray",
		"image": "http://i.imgur.com/zPpNVDs.png",
		"gh_user": "Twinklebear",
		"gh_repo": "tray",
		"description": "tray is a toy physically based ray tracer built off of the techniques discussed in
			[Physically Based Rendering](http://pbrt.org/). It currently has support for path tracing,
			bidirectional path tracing and photon mapping. tray also supports physically materials such as
			microfacet models like Torrance-Sparrow and measured data from the
			[MERL BRDF Database](http://www.merl.com/brdf/).\n\n
			This is the project tray_rust is based on and as such may not see much more development since most
			of my ray tracing work is now going on there."
	},
	{
		"title": "lfwatch",
		"gh_user": "Twinklebear",
		"gh_repo": "lfwatch",
		"description": "lfwatch is a lightweight file watcher for Windows, Linux and OS X. It monitors some
			desired directories for file changes and calls the callback set for the directory with information
			about the file change event. This was written to do hot reloading of GLSL shaders but could be
			useful for some other applications."
	}
	]
]

